import { PageLayout } from '@/shared/layouts/page'

const content = [
  {
    title: 'Збір та Використання Інформації',
    description:
      "Ми можемо збирати різноманітну інформацію від користувачів, включаючи, але не обмежуючись, особисті дані, якщо ви реєструєтеся на нашому веб-сайті, взаємодієте з нашим контентом або використовуєте наші послуги. Ця інформація може включати ім'я, електронну пошту, інформацію про ваший пристрій та інші деталі.\n",
  },
  {
    title: 'Захист Даних',
    description:
      'Ми робимо все можливе для захисту вашої особистої інформації від несанкціонованого доступу, використовуючи технічні та організаційні заходи безпеки',
  },
  {
    title: 'Куки та Треті Сторони',
    description:
      'Наш веб-сайт може використовувати файли кукі та інші технології для збору інформації. Ми також можемо взаємодіяти з третіми сторонами для надання послуг та вдосконалення нашого веб-сайту.',
  },
  {
    title: 'Посилання на Треті Сторони',
    description:
      'Наш веб-сайт може містити посилання на треті сторони, які мають власні політики конфіденційності. Ми рекомендуємо ознайомитися з цими політиками перед наданням інформації.',
  },
  {
    title: 'Зміни у Політиці Конфіденційності',
    description:
      'Ми можемо оновлювати цю політику конфіденційності з часом. Будь ласка, періодично переглядайте цей документ, щоб бути в курсі будь-яких змін.',
  },
]

export const PrivacyPolicyPage = () => {
  return (
    <PageLayout classname="mt-[40px]">
      <section className="flex-col flex gap-y-4">
        <div className="flex m-auto">
          <h1 className="text-xl font-bold">Політика конфіденційності</h1>
        </div>
        <h1 className="text-base font-bold">
          Дякуємо за вибір animeon.top! Наша команда цінує вашу довіру та
          зобов`язується дотримуватися найвищих стандартів конфіденційності та
          безпеки вашої особистої інформації. Ця політика конфіденційності
          пояснює, як ми збираємо, використовуємо та захищаємо ваші дані.
        </h1>
        <div className="flex-col flex gap-4 w-[90%] justify-center m-auto ">
          {content.map((item, i) => (
            <div key={item.title}>
              <h2 className="text-base font-bold">
                {i + 1}. {item.title}
              </h2>
              <p className="text-base">{item.description}</p>
            </div>
          ))}
        </div>
        <div>
          <h2 className="text-base font-bold">
            Якщо у вас є будь-які питання чи зауваження щодо цієї політики
            конфіденційності, звертайтеся до нас за адресою
            animeon.top.help@gmail.com
          </h2>
        </div>
      </section>
    </PageLayout>
  )
}
